Repository: sepehr-rs/Sudoku
Catalog: po/*.po
Languages: de, fa

source: Sudoku
fa: سودوکو

source: Solve Sudoku puzzles
de: Löse Sudoku Rätsel
fa: حل معماهای سودوکو

source: Solve puzzles in style
de: Löse Rätsel mit Stil
fa: حل معماها با سبکی خاص

source: Sudoku is a puzzle app that lets you solve classic number-placement challenges. It features a clean, distraction-free design with a simple interface to keep you focused and engaged.
de: Sudoku ist eine Rätsel-App, mit der Sie klassische Zahlenrätsel lösen können. Sie zeichnet sich durch ein klares, ablenkungsfreies Design mit einer einfachen Benutzeroberfläche aus, damit Sie konzentriert und motiviert bleiben.
fa: سودوکو یه برنامه معماست که به شما اجازه می‌ده تا چالش های کلاسیک جایگشت عددی رو حل کنید. با ارائه طراحی تمیز، بدون حواس‌پرتی با میانای ساده تا شما درگیر و متمرکز بمانید.

source: Features:
de: Merkmale:
fa: ویژگی‌ها:

source: Modern GTK4 and libadwaita interface
de: Moderne GTK4- und libadwaita- Oberfläche
fa: رابط مدرن GTK4 و libadwaita

source: Keyboard shortcuts for quick access to all functions
de: Tastaturkürzel für den schnellen Zugriff auf alle Funktionen
fa: میانبر صفحه‌کلید برای دسترسی سریع به همه عملکردها

source: Save and load games seamlessly to continue your progress anytime
de: Speichern und laden Sie Spiele nahtlos, um jederzeit Ihren Fortschritt fortzusetzen
fa: بازی هارا بی‌وقفه ذخیره و بار کنید تا پیشرفت خود را در هر زمان ادامه دهید

source: Highlight active row and cell to improve focus and ease of play
de: Aktive Zeile und Zelle hervorheben, um die Konzentration zu verbessern und das Spielen zu erleichtern
fa: برای افزایش تمرکز و راحتی در بازی، ردیف فعال و خانه انتخاب شده را برجسته می‌شوند

source: Conflict highlighting to help identify mistakes, ideal for beginners
de: Konflikthervorhebung zur Fehlererkennung, ideal für Anfänger
fa: برجسته‌سازی تضادها برای کمک به شناسایی اشتباهات، ایده‌آل برای مبتدی‌ها

source: Suitable for all skill levels, from beginners to experts
de: Geeignet für alle Leistungsstufen, vom Anfänger bis zum Experten
fa: مناسب برای همه سطوح مهارتی، از مبتدی تا حرفه‌ای

source: Sudoku in light mode
de: Sudoku im Hellmodus
fa: سودوکو در حالت روشن

source: Sudoku in dark mode
de: Sudoku im Dunkelmodus
fa: سودوکو در حالت تیره

source: Sudoku landing page in dark mode
de: Sudoku-Startseite im Dunkelmodus
fa: صفحه فرود سودوکو در حالت تیره

source: Sudoku landing page in light mode
de: Sudoku-Startseite im Hellmodus
fa: صفحه فرود سودوکو در حالت روشن

source: sudoku
fa: سودوکو

source: puzzle
de: Rätsel
fa: معما

source: game
de: Spiel
fa: بازی

source: logic
de: Logik
fa: منطق

source: numbers
de: Zahlen
fa: اعداد

source: Fixed game not being remembered after re-opening Sudoku
fa: ذخیره نشدن بازی ثابت بعد از باز کردن مجدد سودوکو

source: Also moved the Back to main menu button from the primary menu to the headerbar
fa: دکمه «بازگشت به فهرست اصلی» از فهرست اصلی به نوار سربرگ منتقل شد

source: Updated completion screen and added a difficulty subtitle:
fa: صفحه اتمام بازی به‌روزرسانی شد و زیرعنوانی برای سطح سختی اضافه گردید.

source: Completion screen now shows randomized messages with improved imagery
fa: صفحه اتمام بازی حالا پیامهای تصادفی با تصاویر بهتر نمایش می‌دهد

source: Added difficulty level as a subtitle in the header bar
fa: سطح سختی به عنوان زیرتیتر در سربرگ اضافه شد

source: Updated shortcuts:
fa: میان‌برهای به‌روز شده:

source: Added F10 as primary menu's shortcut
fa: کلید F10 به عنوان میانبر فهرست اصلی اضافه شد

source: Added Ctrl + w to close Sudoku
fa: مهار + w برای بستن سودکو افزوده شد

source: Additionally, a logging issue when pencil mode was turned on/off is now fixed.
fa: مشکل ثبت رویداد هنگام روشن و خاموش کردن حالت مداد هم اکنون برطرف شده است

source: Enhanced screen reader support for Sudoku, making the game more accessible and intuitive for players who rely on assistive technologies. With these improvements, users can now:
fa: پشتیبانی بهبود یافته از صفحه‌خوان برای سودوکو، بازی را برای بازیکنانی که به فناوریهای کمکی متکی‌اند، دسترسپذیرتر و شهودی‌تر کرده است. با این پیشرفتها، کاربران اکنون میتوانند راحتتر در بازی حرکت کنند و اطلاعات لازم را دریافت کنند:

source: Receive clear feedback on whether the number they entered is correct or incorrect
fa: دریافت بازخورد واضح درباره اینکه عدد وارد شده درست است یا غلط

source: Navigate the Sudoku interface more easily and efficiently
fa: حرکت در میانای کاربری سودوکو به‌طور آسانتر و مؤثرتر انجام می‌شود.

source: Additionally, a visual bug affecting the pencil icon has been fixed.
fa: یک باگ تصویری که روی آیکون مداد تأثیر می‌گذاشت، اکنون رفع شده است.

source: First stable release of Sudoku! A modern GTK4/libadwaita application for playing Sudoku puzzles.
fa: اولین نگارش پایدار از سودوکو! برنامه مدرن GTK4/libadwaita برای بازی معما‌های سودوکو.

source: Continue Game
de: Spiel Fortsetzen
fa: ادامه بازی

source: New Game
de: Neues Spiel
fa: بازی جدید

source: Back to main menu
de: Zurück zum Hauptmenü
fa: بازگشت به فهرست اصلی

source: Menu
de: Manü
fa: فهرست

source: Toggle Pencil Mode
de: Bleistiftmodus umschalten
fa: فعال/غیرفعال سازی حالت مداد

source: Sudoku Game Icon
de: Sudoku Spiel Icon
fa: نقشک بازی سودوکو

source: Play Sudoku
fa: سودوکو بازی کنید

source: _Continue Game
de: _Spiel fortsetzen
fa: _ادامه بازی

source: _New Game
de: _Neues Spiel
fa: _بازی جدید

source: _Keyboard Shortcuts
de: _Tastaturkürzel
fa: _میان‌برهای صفحه‌کلید

source: Keyboard shortcuts
de: Tastaturkürzel
fa: میان‌برهای صفحه‌کلید

source: How to play
de: Anleitung
fa: راهنمای بازی

source: _About
de: Ü_ber
fa: _درباره

source: About
de: Über
fa: درباره

source: _Quit
de: _Beenden
fa: _خروج

source: Quit
de: Beenden
fa: خروج

source: Back to Main Menu
de: Zurück zum Hauptmenü
fa: بازگشت به فهرست اصلی

# shortcut window
source: Game
de: Spiel
fa: بازی

# shortcut window
source: Pencil Mode
de: Bleistift Modus
fa: حالت مداد

# shortcut window
source: General
de: Allgemein
fa: عمومی

# shortcut window
source: Show Shortcuts
de: Tastaturkürzel anzeigen
fa: نمایش میانبرها

# shortcut window
source: Back to Main Menu
de: Zurück zum Hauptmenü
fa: بازگشت به فهرست اصلی

# shortcut window
source: Quit
de: Beenden
fa: خروج

source: Sudoku Master! You've solved the puzzle with perfect logic!
de: Sudoku-Meister! Du hast das Rätsel mit perfekter Logik gelöst!
fa: استاد سودوکو! با منطق بی‌نقص معما رو حل کردی!

source: Incredible! Every number found its perfect place!
de: Unglaublich! Jede Zahl hat ihren perfekten Platz gefunden!
fa: باورنکردنی! هر عدد سر جای درستش قرار گرفته!

source: Brilliant deduction! You've conquered this Sudoku challenge!
de: Brillante Schlussfolgerung! Du hast diese Sudoku-Herausforderung gemeistert!
fa: نابغه! با استدلال بی‌نظیرت این چالش سودوکو رو فتح کردی!

source: Perfect solution! Your logical thinking is outstanding!
de: Perfekte Lösung! Ihr logisches Denken ist hervorragend!
fa: راه‌حل بی‌نقص! تفکر منطقیت واقعاً عالیه!

source: Amazing work! You've mastered the art of Sudoku!
de: Großartige Arbeit! Du hast die Kunst des Sudoku gemeistert!
fa: کار فوق‌العاده‌ای کردی! هنر حل سودوکو رو به خوبی یاد گرفتی!

source: Fantastic! Every row, column, and box is perfectly filled!
de: Fantastisch! Jede Zeile, Spalte und jedes Feld ist perfekt ausgefüllt!
fa: فوق‌العاده! هر ردیف، ستون و خانه دقیقاً پر شده!

source: Outstanding! Your puzzle-solving skills are remarkable!
de: Hervorragend! Ihre Fähigkeiten beim Lösen von Rätseln sind bemerkenswert!
fa: شکوهمند! مهارت‌هات تو حل معما واقعاً خیره‌کنندست!

source: Excellent! You've completed the Sudoku with flying colors!
de: Ausgezeichnet! Sie haben das Sudoku mit Bravour gelöst!
fa: عالی! شما سودوکو را با رنگهای پرانرژی و کامل تموم کردی!

source: Spectacular! Your mathematical reasoning is top-notch!
de: Spektakulär! Deine mathematischen Fähigkeiten sind erstklassig!
fa: دیدنیه! استدلال ریاضیات واقعا سرآمده!

source: Well done! You've proven yourself a Sudoku champion!
de: Gut gemacht! Sie haben sich als Sudoku-Champion erwiesen!
fa: آفرین! تو یک قهرمان سودوکو هستی!

source: Congratulations! You've solved the puzzle flawlessly!
de: Herzlichen Glückwunsch! Sie haben das Rätsel fehlerfrei gelöst!
fa: تبریک! معمای بازی رو بی‌نقص حل کردی!

source: Victory! Your strategic thinking led to perfect completion!
de: Sieg! Ihr strategisches Denken hat zu einem perfekten Ergebnis geführt!
fa: پیروزی! تفکر استراتژیکت باعث تکمیل بی‌نقص شد!

source: Genius! You've mastered the Sudoku grid with precision!
de: Genial! Sie haben das Sudoku-Raster mit Präzision gemeistert!
fa: نابغه‌ای! با دقت کامل، جدول سودوکو را تسلط پیدا کردی!

source: Masterpiece! Every number placement was calculated perfectly!
de: Meisterwerk! Jede Zahl wurde perfekt platziert!
fa: شاهکار! هر جایگذاری عدد کاملاً حساب شده بود!

source: Phenomenal! You've conquered this Sudoku with style!
de: Phänomenal! Sie haben dieses Sudoku mit Bravour gemeistert!
fa: فوقالعاده! تو با سبک توی این سودوکو پیروز شدی!

source: Wrong
de: Falsch
fa: اشتباه

source: Clear Cell
de: Leere Zelle
fa: پاک‌سازی خانه

source: How to Play Sudoku
de: Wie man Sudoku spielt
fa: چطور سودوکو بازی کنیم

source: Welcome to Sudoku!
de: Willkommen zu Sudoku!
fa: به سودوکو خوش‌آمدید

source: The goal is to fill the grid so that every row, column, and 3x3 box contains the numbers 1 through 9 without repeats.
de: Das Ziel ist es, das Raster so auszufüllen, dass jede Zeile, Spalte und jedes 3x3-Feld die Zahlen 1 bis 9 ohne Wiederholungen enthält.
fa: هدف این است که جدول را طوری پر کنی که در هر ردیف، ستون و کادر ۳×۳، اعداد ۱ تا ۹ بدون تکرار وجود داشته باشند.

source: How to play:
de: Spielanleitung:
fa: نحوه بازی:

source: – Click on an empty cell to select it.
de: – Klicken Sie auf eine leere Zelle, um sie auszuwählen.
fa: روی خانه خالی

source: – Use your keyboard or pencil tool to input a number.
de: – Geben Sie eine Zahl mit Ihrer Tastatur oder dem Bleistift-Werkzeug ein.
fa: - از صفحه‌کلید خود یا ابزار مداد استفاده کنید تا عددی وارد کنید.

source: – Use the pencil tool to make notes.
de: – Verwenden Sie das Bleistift-Werkzeug, um Notizen zu machen.
fa: - از ابزار مداد استفاده کنید تا یادداشت بردارید.

source: – Use the backspace key to clear a cell.
de: – Verwenden Sie die Löschtaste, um eine Zelle zu leeren.
fa: کلید پس‌بر استفاد کنید تا یک خانه را خالی کنید

source: – Try to solve the puzzle logically.
de: – Versuchen Sie, das Rätsel logisch zu lösen.
fa: - تلاش کنید برای حل معماها به‌طور منطقی

source: Good luck and have fun!
de: Viel Glück und viel Spaß!
fa: موفق باشی و خوش‌ بگذره

source: Select Difficulty
de: Schwierigkeitsgrad auswählen
fa: انتخاب سطح

source: Easy
de: Leicht
fa: آسان

source: Medium
de: Mittel
fa: میانه

source: Hard
de: Schwer
fa: سخت

source: Extreme
de: Extrem
fa: شدید

source: Start new game with {} difficulty
de: Starte Sie ein neues Spiel mit dem Schwierigkeitsgrad {}
fa: شروع بازی جدید با سطح {}

source: Sudoku Game
de: Sudoku Spiel
